/*

A k=5 bias=15 n=3
B k=4 bias=7  n=4
转换并向+舍入

A
1 01110 001 -9/16
B
1 0110 0010 -9/16

A               e=22 E=22-15=7 M=1+5/8
0 10110 101         
B               e=7+7=14 
0 1110 1010

A           s=1 e=7 E=7-15=-8 M=1+6/8=14/8 
1 00111 110         E=-8+1=-7 M=14/16=7/8
B           s=1 e=-8+7=-1
1 0000 0111 ###错误 如果计算阶码值e=E+bias=0 表示不能使用规格化
            ###由于E=1-bias 如果e=0相当于E=0-bias M本应/2却相当于扩大了2倍 
            ###发现要使用非规格化时 应当直接使用E而不能再使用e=0

A            
0 00000 101
B
0 0000 0001 #错误 向正舍入 0 0000 0000

A
1 11011 000
B
1 1110 1111 #错误 小数位应当全1来表示最大数 1 1110 0000

A
0 11000 100
B
0 1111 0000 #错误 舍入后为正无穷 0 1110 1111



*/